from flask import Flask
import os

app = Flask(__name__)

@app.route('/')
def home():
    # এখানে আপনি যা ইচ্ছা লিখতে পারেন, আপডেট হলে এটাও অটো আপডেট হবে
    return """
    <div style="text-align: center; margin-top: 50px; font-family: sans-serif;">
        <h1>🚀 অটোমেশন সফল হয়েছে!</h1>
        <p>এই ওয়েবসাইটটি GitHub থেকে অটোমেটিক আপডেট হচ্ছে। 1</p>
        <p>Running on Port: 9090</p>
        <small>Version: 1.0</small>
    </div>
    """

if __name__ == '__main__':
    # পোর্ট 9090 এবং সব আইপি থেকে এক্সেস করার জন্য 0.0.0.0
    app.run(host='0.0.0.0', port=9090)
